### Pandas:  working with columns

The idea is to select rows from a dataframe by first constructing a list of booleans.  That list is formed by analyzing the values in one or more columns of the dataframe.

But first we need a dataframe.

In [80]:
import pandas as pd
import numpy as np
np.random.seed(153)

df = pd.DataFrame({'A':list('abcde'),'B':list(range(5)),
                   'C':[1.414,1.680,1.732,2.718,3.142]})
df

   A  B      C
0  a  0  1.414
1  b  1  1.680
2  c  2  1.732
3  d  3  2.718
4  e  4  3.142

A plain old list will do.

In [81]:
L = [True,False,True,False,True]
df[L]

   A  B      C
0  a  0  1.414
2  c  2  1.732
4  e  4  3.142

Normally the way you obtain a list of booleans is by matching the values in one or more columns against some filter.  It's usually done in one step but we'll break it up by first making a selector.

Notice we use a special pandas method `isin`.

In [82]:
sel = df['A'].isin(list('abd'))
sel

0     True
1     True
2    False
3     True
4    False
Name: A, dtype: bool

In [83]:
print(type(sel))

<class 'pandas.core.series.Series'>

In [84]:
df[sel]

   A  B      C
0  a  0  1.414
1  b  1  1.680
3  d  3  2.718

Logical OR | and AND &

In [85]:
df[(df['B'] == 4) | (df['C'] > 2)]

   A  B      C
3  d  3  2.718
4  e  4  3.142

For complex searchs one can use `apply`, usually with a lambda expression, although it could also be a named function.

In [86]:
def f(row):
    v = row['B']
    def f():
        return v in range(2)
    coin_flip = np.random.choice([0,1])
    if coin_flip:
        return f()
    return True

sel = df.apply(f,axis=1)

In [87]:
df[sel]

   A  B      C
0  a  0  1.414
1  b  1  1.680
2  c  2  1.732
3  d  3  2.718

Double brackets with column names returns those columns in the specified order.

In [88]:
df1 = df[['C','B']]
df1

       C  B
0  1.414  0
1  1.680  1
2  1.732  2
3  2.718  3
4  3.142  4

In the expression above, the docs say that `[,'B', 'F']` is the same as `[:,'B', 'F']`.  The `:` is not necessary.

In [89]:
df1['F'] = [1,2,3,4,5]
df1

       C  B  F
0  1.414  0  1
1  1.680  1  2
2  1.732  2  3
3  2.718  3  4
4  3.142  4  5

In [90]:
df1[['B','F']].to_numpy()

array([[0, 1],
       [1, 2],
       [2, 3],
       [3, 4],
       [4, 5]])

In [91]:
df1[['F','B']] = df1[['B','F']].to_numpy()
df1

       C  B  F
0  1.414  1  0
1  1.680  2  1
2  1.732  3  2
3  2.718  4  3
4  3.142  5  4

The docs this is the way to do it, however, it only works for columns with the same datatype.